<a href="https://colab.research.google.com/github/rogemaro/Data-With-Python-And-Pandas/blob/main/practica_creaci%C3%B3n_y_carga_de_archivos.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Configuraci칩n de Entornos-Creaci칩n y Carga de Archivos**

Lo primero que debemos de hacer para trabajar con archivos dentro de nuestro drive, es conectarlo con nuestro entorno de trabajo

In [4]:
from google.colab import drive
drive.mount("/content/drive")

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [8]:
%cd "/content/drive/My Drive/Colab Notebooks/Pandas/practicas_pandas"
!ls

/content/drive/My Drive/Colab Notebooks/Pandas/practicas_pandas
'practica creacio패n y carga de archivos.ipynb'

Vamos a crear una carpeta dentro de mi carpeta de practicas, en la cual vamos a almacenar las bases de datos. En las rutas que tienen espacios, debemos de agregar un backslash

In [10]:
!mkdir /content/drive/My\ Drive/Colab\ Notebooks/Pandas/practicas_pandas/datas

Vamos a crear una variable que nos alamacene la ruta para no estar escribiendola siempre

In [26]:
dir_storage = "/content/drive/My Drive/Colab Notebooks/Pandas/practicas_pandas/datas/{}"

In [11]:
import pandas as pd
import numpy as np

Almacenaremos un disccionario y posteriormente lo trataremos como un data frame

In [13]:
dict_data = {
    'edad': [10,9,13,14,12,11,12],
    'cm': [115,110,130,155,125,120,125],
    'pais':['co','mx','co','mx','mx','ch','ch'],
    'genero':['M','F','F','M','M','M','F'],
    'Q1':[5,10,8,np.nan,7,8,3],
    'Q2':[7,9,9,8,8,8,9]
}
dict_data

{'Q1': [5, 10, 8, nan, 7, 8, 3],
 'Q2': [7, 9, 9, 8, 8, 8, 9],
 'cm': [115, 110, 130, 155, 125, 120, 125],
 'edad': [10, 9, 13, 14, 12, 11, 12],
 'genero': ['M', 'F', 'F', 'M', 'M', 'M', 'F'],
 'pais': ['co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch']}

In [14]:
df = pd.DataFrame(dict_data)
df

   edad   cm pais genero    Q1  Q2
0    10  115   co      M   5.0   7
1     9  110   mx      F  10.0   9
2    13  130   co      F   8.0   9
3    14  155   mx      M   NaN   8
4    12  125   mx      M   7.0   8
5    11  120   ch      M   8.0   8
6    12  125   ch      F   3.0   9

Vamos a guardar nuestro archivo en formato "csv"

In [ ]:
df.to_csv(dir_storage.format("test.csv", index=False))

Ahora vamos a leer el archivo csv

In [28]:
pd.read_csv(dir_storage.format("test.csv"))

   Unnamed: 0  edad   cm pais genero    Q1  Q2
0           0    10  115   co      M   5.0   7
1           1     9  110   mx      F  10.0   9
2           2    13  130   co      F   8.0   9
3           3    14  155   mx      M   NaN   8
4           4    12  125   mx      M   7.0   8
5           5    11  120   ch      M   8.0   8
6           6    12  125   ch      F   3.0   9

Ahora vamos a guardar y leer nuestro archivo para excel, en formato "xlsx"

In [29]:
df.to_excel(dir_storage.format("test.xlsx"))

In [30]:
pd.read_excel(dir_storage.format("test.xlsx"))

   Unnamed: 0  edad   cm pais genero    Q1  Q2
0           0    10  115   co      M   5.0   7
1           1     9  110   mx      F  10.0   9
2           2    13  130   co      F   8.0   9
3           3    14  155   mx      M   NaN   8
4           4    12  125   mx      M   7.0   8
5           5    11  120   ch      M   8.0   8
6           6    12  125   ch      F   3.0   9

Ahora como formato tipo Json

In [31]:
df.to_json(dir_storage.format("test.json"))

In [32]:
pd.read_json(dir_storage.format("test.json"))

   edad   cm pais genero    Q1  Q2
0    10  115   co      M   5.0   7
1     9  110   mx      F  10.0   9
2    13  130   co      F   8.0   9
3    14  155   mx      M   NaN   8
4    12  125   mx      M   7.0   8
5    11  120   ch      M   8.0   8
6    12  125   ch      F   3.0   9

Ahora lo guardaremos como tipo "pickcle" un formato binario

In [33]:
df.to_pickle(dir_storage.format("test.pkl"))

In [34]:
pd.read_pickle(dir_storage.format("test.pkl"))

   edad   cm pais genero    Q1  Q2
0    10  115   co      M   5.0   7
1     9  110   mx      F  10.0   9
2    13  130   co      F   8.0   9
3    14  155   mx      M   NaN   8
4    12  125   mx      M   7.0   8
5    11  120   ch      M   8.0   8
6    12  125   ch      F   3.0   9

Ahora lo guardaremos como tipo "parquet" un formato de big data con hadoop

In [36]:
df.to_parquet(dir_storage.format("test.parquet"))

In [37]:
pd.read_parquet(dir_storage.format("test.parquet"))

   edad   cm pais genero    Q1  Q2
0    10  115   co      M   5.0   7
1     9  110   mx      F  10.0   9
2    13  130   co      F   8.0   9
3    14  155   mx      M   NaN   8
4    12  125   mx      M   7.0   8
5    11  120   ch      M   8.0   8
6    12  125   ch      F   3.0   9

Ahora lo guardamos como formato "hdf" un **formato** de big data para apache

In [39]:
df.to_hdf(dir_storage.format("test.hdf"), key ="data", format= "table")

In [40]:
pd.read_hdf(dir_storage.format("test.hdf"))

   edad   cm pais genero    Q1  Q2
0    10  115   co      M   5.0   7
1     9  110   mx      F  10.0   9
2    13  130   co      F   8.0   9
3    14  155   mx      M   NaN   8
4    12  125   mx      M   7.0   8
5    11  120   ch      M   8.0   8
6    12  125   ch      F   3.0   9